stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup ADC_LL_Private_Macros ADC Private Macros
  * @{
  */


/**
  * @}
  */


/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup ADC_LL_ES_INIT ADC Exported Init structure
  * @{
  */

/**
  * @brief Structure definition with common setting for the ADC.
  */
typedef struct
{
  FunctionalState ContinuousConvMode;  /*!< Specify whether the conversion is performed in single mode (one conversion)
                                            or continuous mode for ADC group regular, after the first ADC conversion
                                            start trigger occurred (software start or external trigger). This parameter
                                            can be set to ENABLE or DISABLE.
                                            This feature can be modified afterwards using unitary function
                                            @ref LL_ADC_ContinuousModeEnable() or @ref LL_ADC_ContinuousModeDisable().*/

  uint32_t    SequenceLength;          /*!< Specify the length of the conversion sequence.
                                            This parameter must be a number between Min_Data = 1 and Max_Data = 16.
                                            This feature can be modified afterwards using unitary function
                                            @ref LL_ADC_SetSequenceLength(). */

  uint32_t    SamplingMode;            /*!< Specifies the input sampling mode.
                                            This parameter can be a value of @ref ADC_LL_SAMPLING_METHOD.
                                            This feature can be modified afterwards using unitary function
                                            @ref LL_ADC_SetInputSamplingMode(). */

  uint32_t    SampleRate;              /*!< Specify the ADC sample rate.
                                            This parameter can be a value of @ref ADC_LL_SAMPLE_RATE.
                                            This feature can be modified afterwards using unitary function
                                            @ref LL_ADC_SetSampleRate(). */

  uint32_t    Overrun;                 /*!< Specifies the overrung policy applied to the data.
                                            This parameter can be a value of @ref ADC_LL_OVERRUN_CONFIG.
                                            This feature can be modified afterwards using unitary function
                                            @ref LL_ADC_SetOverrunDS(). */
} LL_ADC_InitTypeDef;


/**
  * @brief  Structure definition containing the input voltage range
  *         for each type of ADC input channel.
  */
typedef struct
{
  uint32_t InputVinm0_Vinp0Vinm0;     /*!< Set the input voltage range for single VINM0 or differential (VINP0 - VINM0).
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

  uint32_t InputVinm1_Vinp1Vinm1;     /*!< Set the input voltage range for single VINM1 or differential (VINP1 - VINM1).
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange().  */

  uint32_t InputVinm2_Vinp2Vinm2;     /*!< Set the input voltage range for single VINM2 or differential (VINP2 - VINM2).
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

  uint32_t InputVinm3_Vinp3Vinm3;     /*!< Set the input voltage range for single VINM3 or differential (VINP3 - VINM3).
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

  uint32_t InputVinp0;                /*!< Set the input voltage range for single VINP0.
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

  uint32_t InputVinp1;                /*!< Set the input voltage range for single VINP1.
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

  uint32_t InputVinp2;                /*!< Set the input voltage range for single VINP2.
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

  uint32_t InputVinp3;                /*!< Set the input voltage range for single VINP3.
                                           This parameter can be a value of @ref ADC_LL_INPUT_VOLTAGE_RANGE
                                           This feature can be modified afterwards using unitary function
                                           @ref LL_ADC_SetChannelVoltageRange(). */

} LL_ADC_VoltRangeInitTypeDef;


/**
  * @brief  Structure definition with the input channel entry
  *         for each element of the conversion sequence.
  */
typedef struct
{
  uint32_t ChannelForSeq0;              /*!< Set the channel number code for the 1st conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

