stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
/** @defgroup ADC_LL_Exported_Constants ADC Exported Constants
  * @{
  */


/** @defgroup ADC_LL_SAMPLING_METHOD  ADC input sampling method definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetInputSamplingMode()
  *           and @ref LL_ADC_GetInputSamplingMode()
  * @{
  */

#define LL_ADC_SAMPLING_AT_START    (0x00000000UL)             /*!< Sampling only at conversion start */
#define LL_ADC_SAMPLING_AT_END      (ADC_CONF_ADC_CONT_1V2)    /*!< Sampling starts at the end of conversion (default)*/

/**
  * @}
  */


/** @defgroup ADC_LL_OVERRUN_CONFIG ADC overrun configuration definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetOverrunDF(), @ref LL_ADC_GetOverrunDF(),
  *           @ref LL_ADC_SetOverrunDS(), and @ref LL_ADC_GetOverrunDS()
  * @{
  */

#define LL_ADC_NEW_DATA_IS_LOST    (0x00000000UL)                /*!< Previous data is preserved, new data is lost.   */
#define LL_ADC_NEW_DATA_IS_KEPT    (ADC_CONF_OVR_DS_CFG)         /*!< Previous data is overwritten, new data is kept. */

/**
  * @}
  */

/** @defgroup ADC_LL_SAMPLE_RATE ADC sample rate definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetSampleRate()
  *           and @ref LL_ADC_GetSampleRate()
  *           The  ADC conversion rate is: System clock / (16 + 16*SAMPLE_RATE_MSB + 4*SAMPLE_RATE)
  * @{
  */
#define LL_ADC_SAMPLE_RATE_16  (0x0UL)                                     /*!< ADC conversion rate at F_ADC_CLK / 16 */
#define LL_ADC_SAMPLE_RATE_20  (0x1UL << ADC_CONF_SAMPLE_RATE_Pos)         /*!< ADC conversion rate at F_ADC_CLK / 20 */
#define LL_ADC_SAMPLE_RATE_24  (0x2UL << ADC_CONF_SAMPLE_RATE_Pos)         /*!< ADC conversion rate at F_ADC_CLK / 24 */
#define LL_ADC_SAMPLE_RATE_28  (0x3UL << ADC_CONF_SAMPLE_RATE_Pos)         /*!< ADC conversion rate at F_ADC_CLK / 28 */

#if defined(ADC_CONF_SAMPLE_RATE_MSB)
#define LL_ADC_SAMPLE_RATE_32       (0x1UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 32 */
#define LL_ADC_SAMPLE_RATE_36       (0x1UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 36 */
#define LL_ADC_SAMPLE_RATE_40       (0x1UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 40 */
#define LL_ADC_SAMPLE_RATE_44       (0x1UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 44 */
#define LL_ADC_SAMPLE_RATE_48       (0x2UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 48 */
#define LL_ADC_SAMPLE_RATE_52       (0x2UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 52 */
#define LL_ADC_SAMPLE_RATE_56       (0x2UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 56 */
#define LL_ADC_SAMPLE_RATE_60       (0x2UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 60 */
#define LL_ADC_SAMPLE_RATE_64       (0x3UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 64 */
#define LL_ADC_SAMPLE_RATE_68       (0x3UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 68 */
#define LL_ADC_SAMPLE_RATE_72       (0x3UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 72 */
#define LL_ADC_SAMPLE_RATE_76       (0x3UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 76 */
#define LL_ADC_SAMPLE_RATE_80       (0x4UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 80 */
#define LL_ADC_SAMPLE_RATE_84       (0x4UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 84 */
#define LL_ADC_SAMPLE_RATE_88       (0x4UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 88 */
#define LL_ADC_SAMPLE_RATE_92       (0x4UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 92 */
#define LL_ADC_SAMPLE_RATE_96       (0x5UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 96  */
#define LL_ADC_SAMPLE_RATE_100      (0x5UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 100 */
#define LL_ADC_SAMPLE_RATE_104      (0x5UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 104 */
#define LL_ADC_SAMPLE_RATE_108      (0x5UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 108 */
#define LL_ADC_SAMPLE_RATE_112      (0x6UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 112 */
#define LL_ADC_SAMPLE_RATE_116      (0x6UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 116 */
#define LL_ADC_SAMPLE_RATE_120      (0x6UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 120 */
#define LL_ADC_SAMPLE_RATE_124      (0x6UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 124 */
#define LL_ADC_SAMPLE_RATE_128      (0x7UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x0UL)                             /*!< ADC
                                    conversion rate at F_ADC_CLK / 128 */
#define LL_ADC_SAMPLE_RATE_132      (0x7UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x1UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 132 */
#define LL_ADC_SAMPLE_RATE_136      (0x7UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x2UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 136 */
#define LL_ADC_SAMPLE_RATE_140      (0x7UL << ADC_CONF_SAMPLE_RATE_MSB_Pos | 0x3UL << ADC_CONF_SAMPLE_RATE_Pos) /*!< ADC
                                    conversion rate at F_ADC_CLK / 140 */
#endif /* ADC_CONF_SAMPLE_RATE_MSB */
/**
  * @}
  */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/** @defgroup ADC_LL_OP_MODE ADC operation modes definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetADCMode() and @ref LL_ADC_GetADCMode()
  * @{
  */

