stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
#define LL_ADC_OP_MODE_AUDIO    (0x1UL << ADC_CONF_OP_MODE_Pos)  /*!< ADC operation mode AUDIO */
#define LL_ADC_OP_MODE_ADC      (0x2UL << ADC_CONF_OP_MODE_Pos)  /*!< ADC operation mode ADC   */
#define LL_ADC_OP_MODE_FULL     (0x3UL << ADC_CONF_OP_MODE_Pos)  /*!< ADC operation Full mode  */

/**
  * @}
  */

/** @defgroup ADC_LL_OCM_SOURCE ADC occasional mode source definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetOccasionalConversionSource()
  *           and @ref LL_ADC_GetOccasionalConversionSource()
  * @{
  */

#define LL_ADC_OCM_SRC_VBAT    (0UL)  /*!< ADC occasional mode source VBAT               */
#define LL_ADC_OCM_SRC_TEMP    (1UL)  /*!< ADC occasional mode source temperature sensor */

/**
  * @}
  */

/** @defgroup ADC_LL_PGA_BIAS ADC microphone bias voltage definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetMicrophonePGABias()
  *           and @ref LL_ADC_GetMicrophonePGABias()
  * @{
  */

#define LL_ADC_PGA_BIAS_050_BAT   (0x00000000UL)                       /*!< Set the microphone bias voltage at 0.50 V */
#define LL_ADC_PGA_BIAS_055_BAT   (0x1UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.55 V */
#define LL_ADC_PGA_BIAS_060_BAT   (0x2UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.60 V */
#define LL_ADC_PGA_BIAS_065_BAT   (0x3UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.65 V */
#define LL_ADC_PGA_BIAS_070_BAT   (0x4UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.70 V */
#define LL_ADC_PGA_BIAS_075_BAT   (0x5UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.75 V */
#define LL_ADC_PGA_BIAS_080_BAT   (0x6UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.80 V */
#define LL_ADC_PGA_BIAS_090_BAT   (0x7UL << ADC_PGA_CONF_PGA_BIAS_Pos) /*!< Set the microphone bias voltage at 0.90 V */

/**
  * @}
  */


/** @defgroup ADC_LL_PGA_GAIN ADC microphone gain definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetMicrophonePGAGain()
  *           and @ref LL_ADC_GetMicrophonePGAGain()
  * @{
  */

#define LL_ADC_PGA_GAIN_00_DB   (0x00000000UL)  /*!< Set the microphone gain at 0 dB  */
#define LL_ADC_PGA_GAIN_03_DB   (0x00000001UL)  /*!< Set the microphone gain at 3 dB  */
#define LL_ADC_PGA_GAIN_06_DB   (0x00000002UL)  /*!< Set the microphone gain at 6 dB */
#define LL_ADC_PGA_GAIN_09_DB   (0x00000003UL)  /*!< Set the microphone gain at 9 dB */
#define LL_ADC_PGA_GAIN_12_DB   (0x00000004UL)  /*!< Set the microphone gain at 12 dB */
#define LL_ADC_PGA_GAIN_15_DB   (0x00000005UL)  /*!< Set the microphone gain at 15 dB */
#define LL_ADC_PGA_GAIN_18_DB   (0x00000006UL)  /*!< Set the microphone gain at 18 dB */
#define LL_ADC_PGA_GAIN_21_DB   (0x00000007UL)  /*!< Set the microphone gain at 21 dB */
#define LL_ADC_PGA_GAIN_24_DB   (0x00000008UL)  /*!< Set the microphone gain at 24 dB */
#define LL_ADC_PGA_GAIN_27_DB   (0x00000009UL)  /*!< Set the microphone gain at 27 dB */
#define LL_ADC_PGA_GAIN_30_DB   (0x0000000AUL)  /*!< Set the microphone gain at 30 dB */

/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/** @defgroup ADC_LL_INPUT_VOLTAGE_RANGE ADC input voltage range definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetChannelVoltageRange()
  *           and @ref LL_ADC_GetChannelVoltageRange()
  * @{
  */

#define LL_ADC_VIN_RANGE_1V2    (0UL)  /*!< ADC input voltage range up to 1.2 V */
#define LL_ADC_VIN_RANGE_2V4    (2UL)  /*!< ADC input voltage range up to 2.4 V */
#define LL_ADC_VIN_RANGE_3V6    (3UL)  /*!< ADC input voltage range up to 3.6 V */

/**
  * @}
  */


/** @defgroup ADC_LL_DEFAULT_RANGE_VALUE ADC default range value definitions
  * @brief    It defines the parameters used as default range value
  * @{
  */

#define LL_ADC_DEFAULT_RANGE_VALUE_1V2    (0xFFFUL)  /*!< ADC default range value up to 1.2 V */
#define LL_ADC_DEFAULT_RANGE_VALUE_2V4    (0x7FFUL)  /*!< ADC default range value up to 2.4 V */
#define LL_ADC_DEFAULT_RANGE_VALUE_3V6    (0x555UL)  /*!< ADC default range value up to 3.6 V */

/**
  * @}
  */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/** @defgroup ADC_LL_DF_DYN_RANGE ADC Decimation Filter dynamic range definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetDFInputDynamic()
  *           and @ref LL_ADC_GetDFInputDynamic()
  * @{
  */

#define LL_ADC_DF_DYN_RANGE_FULL    (0x00000000UL)                              /*!< ADC Decimation Filter dynamic
                                                                                     full range */
#define LL_ADC_DF_DYN_RANGE_HALF    (0x1UL << ADC_DF_CONF_DF_HALF_D_EN_Pos)     /*!< ADC Decimation Filter dynamic
                                                                                     half range */

/**
  * @}
  */


/** @defgroup ADC_LL_MIC_CHANNEL ADC microphone channel definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetMicrophoneChannel()
  *           and @ref LL_ADC_GetMicrophoneChannel()
  * @{
  */

#define LL_ADC_DF_MIC_CH_RIGHT    (0x00000000UL)                           /*!< ADC microphone channel right */
#define LL_ADC_DF_MIC_CH_LEFT     (0x1UL << ADC_DF_CONF_DF_MICROL_RN_Pos)  /*!< ADC microphone channel left  */

/**
  * @}
  */


/** @defgroup ADC_LL_PDM_CLK_DIVIDER ADC PDM clock divider definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetPDMRate() and @ref LL_ADC_GetPDMRate()
  * @{
  */

#define LL_ADC_PDM_DIV_10   (0x00000000UL)                       /*!< ADC PDM clock divider 10 */
#define LL_ADC_PDM_DIV_11   (0x1UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 11 */
#define LL_ADC_PDM_DIV_12   (0x2UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 12 */
#define LL_ADC_PDM_DIV_13   (0x3UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 13 */
#define LL_ADC_PDM_DIV_14   (0x4UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 14 */
#define LL_ADC_PDM_DIV_15   (0x5UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 15 */
#define LL_ADC_PDM_DIV_16   (0x6UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 16 */
#define LL_ADC_PDM_DIV_17   (0x7UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 17 */
#define LL_ADC_PDM_DIV_18   (0x8UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 18 */
#define LL_ADC_PDM_DIV_19   (0x9UL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 19 */
#define LL_ADC_PDM_DIV_20   (0xAUL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 20 */
#define LL_ADC_PDM_DIV_21   (0xBUL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 21 */
#define LL_ADC_PDM_DIV_22   (0xCUL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 22 */
#define LL_ADC_PDM_DIV_23   (0xDUL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 23 */
#define LL_ADC_PDM_DIV_24   (0xEUL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 24 */
#define LL_ADC_PDM_DIV_25   (0xFUL << ADC_DF_CONF_PDM_RATE_Pos)  /*!< ADC PDM clock divider 25 */

/**
  * @}
  */


/** @defgroup ADC_LL_DATA_FORMAT ADC data format definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetDataOutputFormat(),
  *           @ref LL_ADC_GetDataOutputFormat(), @ref LL_ADC_SetDataInputFormat() and @ref LL_ADC_GetDataInputFormat()
  * @{
  */

