stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
#define LL_ADC_DF_DATA_FORMAT_SIGNED    (0UL)  /*!< ADC data format signed   */
#define LL_ADC_DF_DATA_FORMAT_UNSIGNED  (1UL)  /*!< ADC data format unsigned */

/**
  * @}
  */


/** @defgroup ADC_LL_CIC_DECIMATOR_FACTOR ADC CIC decimator factor definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetCICDecimatorFactor()
  *           and @ref LL_ADC_GetCICDecimatorFactor()
  * @{
  */

#define LL_ADC_DF_CIC_DECIMATOR_FACTOR_HALF     (ADC_DF_CONF_DF_CIC_DHF)  /*!< ADC CIC decimator factor half    */
#define LL_ADC_DF_CIC_DECIMATOR_FACTOR_INTEGER  (0x00000000UL)            /*!< ADC CIC decimator factor integer */

/**
  * @}
  */


/** @defgroup ADC_LL_MICROPHONE_OUT_FREQ ADC microphone output frequency definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetMicrophoneOutputDatarate()
  *           and @ref LL_ADC_GetMicrophoneOutputDatarate()
  * @{
  */

#define LL_ADC_OUTPUT_FREQ_MIC_DIG_47619_HZ  (0x0EUL)  /*!< ADC digital microphone output frequency 47.619 kHz */
#define LL_ADC_OUTPUT_FREQ_MIC_DIG_44440_HZ  (0x0FUL)  /*!< ADC digital microphone output frequency 44.44  kHz */
#define LL_ADC_OUTPUT_FREQ_MIC_DIG_22220_HZ  (0x1EUL)  /*!< ADC digital microphone output frequency 22.22  kHz */
#define LL_ADC_OUTPUT_FREQ_MIC_DIG_15873_HZ  (0x2AUL)  /*!< ADC digital microphone output frequency 15.873 kHz */
#define LL_ADC_OUTPUT_FREQ_MIC_DIG_7936_HZ   (0x54UL)  /*!< ADC digital microphone output frequency  7.936 kHz */

#define LL_ADC_OUTPUT_FREQ_MIC_ANA_200000_HZ (0x02UL)  /*!< ADC analog microphone output frequency 200.00 kHz */
#define LL_ADC_OUTPUT_FREQ_MIC_ANA_15873_HZ  (0x15UL)  /*!< ADC analog microphone output frequency 15.873 kHz */
#define LL_ADC_OUTPUT_FREQ_MIC_ANA_7936_HZ   (0x2AUL)  /*!< ADC analog microphone output frequency  7.936 kHz */

/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/** @defgroup ADC_LL_DS_DATA_WIDTH ADC Down Sampler data width definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetDSDataOutputWidth()
  *           and @ref LL_ADC_GetDSDataOutputWidth()
  * @{
  */

#define LL_ADC_DS_DATA_WIDTH_12_BIT  (0UL)  /*!< ADC Down Sampler data width 12 bits */
#define LL_ADC_DS_DATA_WIDTH_13_BIT  (1UL)  /*!< ADC Down Sampler data width 13 bits */
#define LL_ADC_DS_DATA_WIDTH_14_BIT  (2UL)  /*!< ADC Down Sampler data width 14 bits */
#define LL_ADC_DS_DATA_WIDTH_15_BIT  (3UL)  /*!< ADC Down Sampler data width 15 bits */
#define LL_ADC_DS_DATA_WIDTH_16_BIT  (4UL)  /*!< ADC Down Sampler data width 16 bits */

/**
  * @}
  */


/** @defgroup ADC_LL_DS_RATIO ADC Down Sampler ratio definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetDSDataOutputRatio()
  *           and @ref LL_ADC_GetDSDataOutputRatio()
  * @{
  */

#define LL_ADC_DS_RATIO_1    (0UL)          /*!< ADC Down Sampler ratio 1, no down sampling (default) */
#define LL_ADC_DS_RATIO_2    (1UL)          /*!< ADC Down Sampler ratio 2                             */
#define LL_ADC_DS_RATIO_4    (2UL)          /*!< ADC Down Sampler ratio 4                             */
#define LL_ADC_DS_RATIO_8    (3UL)          /*!< ADC Down Sampler ratio 8                             */
#define LL_ADC_DS_RATIO_16   (4UL)          /*!< ADC Down Sampler ratio 16                            */
#define LL_ADC_DS_RATIO_32   (5UL)          /*!< ADC Down Sampler ratio 32                            */
#define LL_ADC_DS_RATIO_64   (6UL)          /*!< ADC Down Sampler ratio 64                            */
#define LL_ADC_DS_RATIO_128  (7UL)          /*!< ADC Down Sampler ratio 128                           */

/**
  * @}
  */


/** @defgroup ADC_LL_CHANNEL ADC channel number code for conversion definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetSequencerRanks()
  * @{
  */

#define LL_ADC_CHANNEL_VINM0             (0x00UL)  /*!< ADC channel for VINM0 to single negative input */
#define LL_ADC_CHANNEL_VINM1             (0x01UL)  /*!< ADC channel for VINM1 to single negative input */
#define LL_ADC_CHANNEL_VINM2             (0x02UL)  /*!< ADC channel for VINM2 to single negative input */
#define LL_ADC_CHANNEL_VINM3             (0x03UL)  /*!< ADC channel for VINM3 to single negative input */
#define LL_ADC_CHANNEL_VINP0             (0x04UL)  /*!< ADC channel for VINP0 to single positive input */
#define LL_ADC_CHANNEL_VINP1             (0x05UL)  /*!< ADC channel for VINP1 to single positive input */
#define LL_ADC_CHANNEL_VINP2             (0x06UL)  /*!< ADC channel for VINP2 to single positive input */
#define LL_ADC_CHANNEL_VINP3             (0x07UL)  /*!< ADC channel for VINP3 to single positive input */
#define LL_ADC_CHANNEL_VINP0_VINM0       (0x08UL)  /*!< ADC channel for VINP0 - VINM0 to differential input */
#define LL_ADC_CHANNEL_VINP1_VINM1       (0x09UL)  /*!< ADC channel for VINP1 - VINM1 to differential input */
#define LL_ADC_CHANNEL_VINP2_VINM2       (0x0AUL)  /*!< ADC channel for VINP2 - VINM2 to differential input */
#define LL_ADC_CHANNEL_VINP3_VINM3       (0x0BUL)  /*!< ADC channel for VINP3 - VINM3 to differential input */
#define LL_ADC_CHANNEL_VBAT              (0x0CUL)  /*!< ADC channel for VBAT, battery level detector */
#define LL_ADC_CHANNEL_TEMPSENSOR        (0x0DUL)  /*!< ADC channel for temperature sensor */

/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SEQ_RANKS  ADC - Sequencer ranks
  * @{
  */
#define LL_ADC_RANK_1  (ADC_SEQ_1_REGOFFSET | ADC_RANK_1_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  1 */
#define LL_ADC_RANK_2  (ADC_SEQ_1_REGOFFSET | ADC_RANK_2_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  2 */
#define LL_ADC_RANK_3  (ADC_SEQ_1_REGOFFSET | ADC_RANK_3_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  3 */
#define LL_ADC_RANK_4  (ADC_SEQ_1_REGOFFSET | ADC_RANK_4_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  4 */
#define LL_ADC_RANK_5  (ADC_SEQ_1_REGOFFSET | ADC_RANK_5_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  5 */
#define LL_ADC_RANK_6  (ADC_SEQ_1_REGOFFSET | ADC_RANK_6_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  6 */
#define LL_ADC_RANK_7  (ADC_SEQ_1_REGOFFSET | ADC_RANK_7_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  7 */
#define LL_ADC_RANK_8  (ADC_SEQ_1_REGOFFSET | ADC_RANK_8_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  8 */
#define LL_ADC_RANK_9  (ADC_SEQ_2_REGOFFSET | ADC_RANK_9_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  9 */
#define LL_ADC_RANK_10 (ADC_SEQ_2_REGOFFSET | ADC_RANK_10_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 10 */
#define LL_ADC_RANK_11 (ADC_SEQ_2_REGOFFSET | ADC_RANK_11_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 11 */
#define LL_ADC_RANK_12 (ADC_SEQ_2_REGOFFSET | ADC_RANK_12_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 12 */
#define LL_ADC_RANK_13 (ADC_SEQ_2_REGOFFSET | ADC_RANK_13_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 13 */
#define LL_ADC_RANK_14 (ADC_SEQ_2_REGOFFSET | ADC_RANK_14_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 14 */
#define LL_ADC_RANK_15 (ADC_SEQ_2_REGOFFSET | ADC_RANK_15_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 15 */
#define LL_ADC_RANK_16 (ADC_SEQ_2_REGOFFSET | ADC_RANK_16_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 16 */
/**
  * @}
  */

