stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
/** @defgroup ADC_LL_CALIB_POINT ADC calibration points definitions
  * @brief    It defines the parameters used for the functions
  *           @ref LL_ADC_SetCalibPointForDiff(), @ref LL_ADC_GetCalibPointForDiff(),
  *           @ref LL_ADC_SetCalibPointForSinglePos(), @ref LL_ADC_GetCalibPointForSinglePos(),
  *           @ref LL_ADC_SetCalibPointForSingleNeg(), @ref LL_ADC_GetCalibPointForSingleNeg(),
  * @{
  */

#define LL_ADC_CALIB_POINT_1  (0x00UL)  /*!< ADC calibration point 1 */
#define LL_ADC_CALIB_POINT_2  (0x01UL)  /*!< ADC calibration point 2 */
#define LL_ADC_CALIB_POINT_3  (0x02UL)  /*!< ADC calibration point 3 */
#define LL_ADC_CALIB_POINT_4  (0x03UL)  /*!< ADC calibration point 4 */

/**
  * @}
  */

/** @defgroup ADC_LL_AWD_CHANNEL ADC watchdog channel selection for bit mask definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetAWDInputChannels()
  *           and @ref LL_ADC_GetAWDInputChannels()
  * @{
  */

#define LL_ADC_AWD_CH_VINM0      (ADC_WD_CONF_AWD_CHX_0 ) /*!< ADC watchdog channel selection: VINM0 to negative input  */
#define LL_ADC_AWD_CH_VINM1      (ADC_WD_CONF_AWD_CHX_1 ) /*!< ADC watchdog channel selection: VINM1 to negative input  */
#define LL_ADC_AWD_CH_VINM2      (ADC_WD_CONF_AWD_CHX_2 ) /*!< ADC watchdog channel selection: VINM2 to negative input  */
#define LL_ADC_AWD_CH_VINM3      (ADC_WD_CONF_AWD_CHX_3 ) /*!< ADC watchdog channel selection: VINM3 to negative input  */
#define LL_ADC_AWD_CH_VINP0      (ADC_WD_CONF_AWD_CHX_8 ) /*!< ADC watchdog channel selection: VINP0 to positive input  */
#define LL_ADC_AWD_CH_VINP1      (ADC_WD_CONF_AWD_CHX_9 ) /*!< ADC watchdog channel selection: VINP1 to positive input  */
#define LL_ADC_AWD_CH_VINP2      (ADC_WD_CONF_AWD_CHX_10) /*!< ADC watchdog channel selection: VINP2 to positive input  */
#define LL_ADC_AWD_CH_VINP3      (ADC_WD_CONF_AWD_CHX_11) /*!< ADC watchdog channel selection: VINP3 to positive input  */
#define LL_ADC_AWD_CH_MICROM     (ADC_WD_CONF_AWD_CHX_4 ) /*!< ADC watchdog channel selection: MICROM to negative input */
#define LL_ADC_AWD_CH_MICROP     (ADC_WD_CONF_AWD_CHX_12) /*!< ADC watchdog channel selection: MICROP to positive input */
#define LL_ADC_AWD_CH_VBAT       (ADC_WD_CONF_AWD_CHX_5 ) /*!< ADC watchdog channel selection: VBAT to negative input   */
#define LL_ADC_AWD_CH_TEMPSENSOR (ADC_WD_CONF_AWD_CHX_13) /*!< ADC watchdog channel selection: TEMP to positive input   */
#define LL_ADC_AWD_CH_VDDA_NEG   (ADC_WD_CONF_AWD_CHX_7 ) /*!< ADC watchdog channel selection: VDDA to negative input   */
#define LL_ADC_AWD_CH_VDDA_POS   (ADC_WD_CONF_AWD_CHX_15) /*!< ADC watchdog channel selection: VDDA to positive input   */
#define LL_ADC_AWD_CH_GND_NEG    (ADC_WD_CONF_AWD_CHX_6 ) /*!< ADC watchdog channel selection: GND to negative input    */
#define LL_ADC_AWD_CH_GND_POS    (ADC_WD_CONF_AWD_CHX_14) /*!< ADC watchdog channel selection: GND to positive input    */

/**
  * @}
  */


/** @defgroup ADC_LL_IRQ_STATUS_MASK ADC IRQ_STATUS register mask definitions
  * @brief    It defines the IRQ flags used for the functions @ref LL_ADC_ClearActiveFlags()
  *           and @ref LL_ADC_GetActiveFlags().
  * @{
  */
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
#define LL_ADC_IRQ_FLAG_OVRFL   (ADC_IRQ_STATUS_DF_OVRFL_IRQ) /*!< ADC IRQ flag OVRFL */
#define LL_ADC_IRQ_FLAG_OVRDF   (ADC_IRQ_STATUS_OVR_DF_IRQ)   /*!< ADC IRQ flag OVRDF */
#define LL_ADC_IRQ_FLAG_EODF    (ADC_IRQ_STATUS_EODF_IRQ)     /*!< ADC IRQ flag EODF  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
#define LL_ADC_IRQ_FLAG_OVRDS   (ADC_IRQ_STATUS_OVR_DS_IRQ)   /*!< ADC IRQ flag OVRDS */
#define LL_ADC_IRQ_FLAG_AWD1    (ADC_IRQ_STATUS_AWD_IRQ)      /*!< ADC IRQ flag AWD1  */
#define LL_ADC_IRQ_FLAG_EOC     (ADC_IRQ_STATUS_EOC_IRQ)      /*!< ADC IRQ flag EOC   */
#define LL_ADC_IRQ_FLAG_EOS     (ADC_IRQ_STATUS_EOS_IRQ)      /*!< ADC IRQ flag EOS   */
#define LL_ADC_IRQ_FLAG_EODS    (ADC_IRQ_STATUS_EODS_IRQ)     /*!< ADC IRQ flag EODS  */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
#define LL_ADC_IRQ_FLAGS_MASK   (LL_ADC_IRQ_FLAG_OVRFL | \
                                 LL_ADC_IRQ_FLAG_OVRDF | \
                                 LL_ADC_IRQ_FLAG_OVRDS | \
                                 LL_ADC_IRQ_FLAG_AWD1  | \
                                 LL_ADC_IRQ_FLAG_EOC   | \
                                 LL_ADC_IRQ_FLAG_EOS   | \
                                 LL_ADC_IRQ_FLAG_EODF  | \
                                 LL_ADC_IRQ_FLAG_EODS)
#else
#define LL_ADC_IRQ_FLAGS_MASK   (LL_ADC_IRQ_FLAG_OVRDS | \
                                 LL_ADC_IRQ_FLAG_AWD1  | \
                                 LL_ADC_IRQ_FLAG_EOC   | \
                                 LL_ADC_IRQ_FLAG_EOS   | \
                                 LL_ADC_IRQ_FLAG_EODS)
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/**
  * @}
  */


/** @defgroup ADC_LL_IRQ_ENABLE ADC interrupts enable definitions
  * @brief    It defines the IRQ interrupt enable used for the functions @ref LL_ADC_ClearActiveFlags()
  *           and @ref LL_ADC_GetActiveFlags().
  * @{
  */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
#define LL_ADC_IRQ_EN_OVRFL   (ADC_IRQ_ENABLE_DF_OVRFL_IRQ_ENA) /*!< ADC IRQ enable OVRFL */
#define LL_ADC_IRQ_EN_OVRDF   (ADC_IRQ_ENABLE_OVR_DF_IRQ_ENA)   /*!< ADC IRQ enable OVRDF */
#define LL_ADC_IRQ_EN_EODF    (ADC_IRQ_ENABLE_EODF_IRQ_ENA)     /*!< ADC IRQ enable EODF  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
#define LL_ADC_IRQ_EN_OVRDS   (ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA)   /*!< ADC IRQ enable OVRDS */
#define LL_ADC_IRQ_EN_AWD1    (ADC_IRQ_ENABLE_AWD_IRQ_ENA)      /*!< ADC IRQ enable AWD1  */
#define LL_ADC_IRQ_EN_EOC     (ADC_IRQ_ENABLE_EOC_IRQ_ENA)      /*!< ADC IRQ enable EOC   */
#define LL_ADC_IRQ_EN_EOS     (ADC_IRQ_ENABLE_EOS_IRQ_ENA)      /*!< ADC IRQ enable EOS   */
#define LL_ADC_IRQ_EN_EODS    (ADC_IRQ_ENABLE_EODS_IRQ_ENA)     /*!< ADC IRQ enable EODS  */

/**
  * @}
  */

/**
  * @}
  */


/* Exported macro ------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Macros ADC Exported Macros
  * @{
  */

/** @defgroup ADC_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/**
  * @brief  Driver macro reserved for internal use: set a pointer to
  *         a register from a register basis from which an offset
  *         is applied.
  * @param  __REG__ Register basis from which the offset is applied.
  * @param  __REG_OFFFSET__ Offset to be applied (unit: number of registers).
  * @retval Pointer to register address
  */
#define __ADC_PTR_REG_OFFSET(__REG__, __REG_OFFFSET__)                         \
  ((__IO uint32_t *)((uint32_t) ((uint32_t)(&(__REG__)) + ((__REG_OFFFSET__) << 2UL))))

/**
  * @}
  */

