stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
#if defined(ADC_CONF_OVR_DF_CFG)
/**
  * @brief  Select the overrun configuration for the output data of
  *         the Decimation Filter (DF).
  *         Previous data is kept, the new one is lost.
  *         Previous data is lost, the new one is kept.
  * @rmtoll CONF     OVR_DF_CFG       LL_ADC_SetOverrunDF
  * @param  ADCx ADC instance
  * @param  Overrun This parameter can be one of the following values:
  *         @arg @ref LL_ADC_NEW_DATA_IS_LOST
  *         @arg @ref LL_ADC_NEW_DATA_IS_KEPT
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetOverrunDF(ADC_TypeDef *ADCx, uint32_t Overrun)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_OVR_DF_CFG, Overrun);
}

/**
  * @brief  Get the overrun configuration for the output data of
  *         the Decimation Filter (DF).
  *         Previous data is kept, the new one is lost.
  *         Previous data is lost, the new one is kept.
  * @rmtoll CONF     OVR_DF_CFG       LL_ADC_GetOverrunDF
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_NEW_DATA_IS_LOST
  *         @arg @ref LL_ADC_NEW_DATA_IS_KEPT
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverrunDF(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_OVR_DF_CFG));
}
#endif /* ADC_CONF_OVR_DF_CFG */

/**
  * @brief  Select the overrun configuration for the output data of
  *         the Down Sampler (DS).
  *         Previous data is kept, the new one is lost.
  *         Previous data is lost, the new one is kept.
  * @rmtoll CONF     OVR_DS_CFG       LL_ADC_SetOverrunDS
  * @param  ADCx ADC instance
  * @param  Overrun This parameter can be one of the following values:
  *         @arg @ref LL_ADC_NEW_DATA_IS_LOST
  *         @arg @ref LL_ADC_NEW_DATA_IS_KEPT
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetOverrunDS(ADC_TypeDef *ADCx, uint32_t Overrun)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_OVR_DS_CFG, Overrun);
}

/**
  * @brief  Get the overrun configuration for the output data of
  *         the Down Sampler (DS).
  *         Previous data is kept, the new one is lost.
  *         Previous data is lost, the new one is kept.
  * @rmtoll CONF     OVR_DS_CFG       LL_ADC_GetOverrunDS
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_NEW_DATA_IS_LOST
  *         @arg @ref LL_ADC_NEW_DATA_IS_KEPT
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverrunDS(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_OVR_DS_CFG));
}

#if defined(ADC_CONF_DMA_DF_ENA)
/**
  * @brief  Enable the DMA mode for the Decimation Filter (DF) data path.
  * @rmtoll CONF     DMA_DF_ENA     LL_ADC_DMAModeDFEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DMAModeDFEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_DMA_DF_ENA);
}

/**
  * @brief  Disable the DMA mode for the Decimation Filter (DF) data path.
  * @rmtoll CONF     DMA_DF_ENA     LL_ADC_DMAModeDFDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DMAModeDFDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_DMA_DF_ENA);
}


/**
  * @brief  Check if the DMA mode for the Decimation Filter (DF) data path is enabled.
  * @rmtoll CONF     DMA_DF_ENA     LL_ADC_IsDMAModeDFEnabled
  * @param  ADCx ADC instance
  * @retval 0: DMA mode is not enabled, 1: DMA mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsDMAModeDFEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_DMA_DF_ENA) == (ADC_CONF_DMA_DF_ENA)) ? 1UL : 0UL);
}
#endif /* ADC_CONF_DMA_DF_ENA */

/**
  * @brief  Enable the DMA mode for the Down Sampler (DS) data path.
  * @rmtoll CONF     DMA_DS_ENA     LL_ADC_DMAModeDSEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DMAModeDSEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_DMA_DS_ENA);
}


/**
  * @brief  Disable the DMA mode for the Down Sampler (DS) data path.
  * @rmtoll CONF     DMA_DS_ENA     LL_ADC_DMAModeDSDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DMAModeDSDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_DMA_DS_ENA);
}


/**
  * @brief  Check if the DMA mode for the Down Sampler (DS) data path is enabled.
  * @rmtoll CONF     DMA_DS_ENA     LL_ADC_IsDMAModeDSEnabled
  * @param  ADCx ADC instance
  * @retval 0: DMA mode is not enabled, 1: DMA mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsDMAModeDSEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_DMA_DS_ENA) == (ADC_CONF_DMA_DS_ENA)) ? 1UL : 0UL);
}

/**
  * @brief  Select the ADC conversion rate.
  * @rmtoll CONF     SAMPLE_RATE       LL_ADC_SetSampleRate
  * @param  ADCx ADC instance
  * @param  SampleRate This parameter can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLE_RATE_16
  *         @arg @ref LL_ADC_SAMPLE_RATE_20
  *         @arg @ref LL_ADC_SAMPLE_RATE_24
  *         @arg @ref LL_ADC_SAMPLE_RATE_28
  *         @arg @ref LL_ADC_SAMPLE_RATE_32  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_36  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_40  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_44  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_48  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_52  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_56  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_60  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_64  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_68  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_72  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_76  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_80  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_84  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_88  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_92  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_96  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_100 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_104 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_108 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_112 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_116 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_120 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_124 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_128 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_132 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_136 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_140 (1)
  *
  *         (1) Parameter only available on STM32WB09 and STM32WB05
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetSampleRate(ADC_TypeDef *ADCx, uint32_t SampleRate)
{
#if defined(ADC_CONF_SAMPLE_RATE_MSB)
  MODIFY_REG(ADCx->CONF, ADC_CONF_SAMPLE_RATE | ADC_CONF_SAMPLE_RATE_MSB, SampleRate);
#else
  MODIFY_REG(ADCx->CONF, ADC_CONF_SAMPLE_RATE, SampleRate);
#endif /* ADC_CONF_SAMPLE_RATE_MSB */
}


/**
  * @brief  Get the ADC conversion rate.
  * @rmtoll CONF     SAMPLE_RATE       LL_ADC_GetSampleRate
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLE_RATE_16
  *         @arg @ref LL_ADC_SAMPLE_RATE_20
  *         @arg @ref LL_ADC_SAMPLE_RATE_24
  *         @arg @ref LL_ADC_SAMPLE_RATE_28
  *         @arg @ref LL_ADC_SAMPLE_RATE_32  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_36  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_40  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_44  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_48  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_52  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_56  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_60  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_64  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_68  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_72  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_76  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_80  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_84  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_88  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_92  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_96  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_100 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_104 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_108 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_112 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_116 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_120 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_124 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_128 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_132 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_136 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_140 (1)
  *
  *         (1) Parameter only available on STM32WB09 and STM32WB05
  */
__STATIC_INLINE uint32_t LL_ADC_GetSampleRate(const ADC_TypeDef *ADCx)
{
#if defined(ADC_CONF_SAMPLE_RATE_MSB)
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_SAMPLE_RATE | ADC_CONF_SAMPLE_RATE_MSB));
#else
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_SAMPLE_RATE));
#endif /* ADC_CONF_SAMPLE_RATE_MSB */
}

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/**
  * @brief  Select the ADC operation mode.
  * @rmtoll CONF     OP_MODE       LL_ADC_SetADCMode
  * @param  ADCx ADC instance
  * @param  OperationMode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OP_MODE_AUDIO
  *         @arg @ref LL_ADC_OP_MODE_ADC
  *         @arg @ref LL_ADC_OP_MODE_FULL
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetADCMode(ADC_TypeDef *ADCx, uint32_t OperationMode)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_OP_MODE, OperationMode);
}


/**
  * @brief  Get the ADC operation mode.
  * @rmtoll CONF     OP_MODE       LL_ADC_GetADCMode
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_OP_MODE_AUDIO
  *         @arg @ref LL_ADC_OP_MODE_ADC
  *         @arg @ref LL_ADC_OP_MODE_FULL
  */
__STATIC_INLINE uint32_t LL_ADC_GetADCMode(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_OP_MODE));
}
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/**
  * @brief  Enable the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS.
  * @note   This bitfield must be 0 when the ADC clock is 32 MHz or
  *         when the SMPS is not used.
  * @rmtoll CONF     SMPS_SYNCHRO_ENA     LL_ADC_SMPSSyncEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SMPSSyncEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_SMPS_SYNCHRO_ENA);
}

/**
  * @brief  Disable the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS.
  * @note   This bitfield must be 0 when the ADC clock is 32 MHz or
  *         when the SMPS is not used.
  * @rmtoll CONF     SMPS_SYNCHRO_ENA     LL_ADC_SMPSSyncDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SMPSSyncDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_SMPS_SYNCHRO_ENA);
}


/**
  * @brief  Check if the the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS is enabled.
  * @note   This bitfield must be 0 when the ADC clock is 32 MHz or
  *         when the SMPS is not used.
  * @rmtoll CONF     SMPS_SYNCHRO_ENA     LL_ADC_IsSMPSSyncEnabled
  * @param  ADCx ADC instance
  * @retval 0: Synchronization with SMPS is not enabled, 1: Synchronization with SMPS is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsSMPSSyncEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_SMPS_SYNCHRO_ENA) == (ADC_CONF_SMPS_SYNCHRO_ENA)) ? 1UL : 0UL);
}


/**
  * @brief  Set the number of conversion in a sequence starting from SEQ0.
  * @rmtoll CONF     SEQ_LEN       LL_ADC_SetSequenceLength
  * @param  ADCx ADC instance
  * @param  SequenceLength This parameter must be a number between Min_Data = 1 and Max_Data = 16.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetSequenceLength(ADC_TypeDef *ADCx, uint32_t SequenceLength)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_SEQ_LEN, (SequenceLength - 1UL) << ADC_CONF_SEQ_LEN_Pos);
}


/**
  * @brief  Get the number of conversion in a sequence starting from SEQ0.
  * @rmtoll CONF     SEQ_LEN       LL_ADC_GetSequenceLength
  * @param  ADCx ADC instance
  * @retval Returned value is a number between Min_Data = 1 and Max_Data = 16.
  */
__STATIC_INLINE uint32_t LL_ADC_GetSequenceLength(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_SEQ_LEN) >> ADC_CONF_SEQ_LEN_Pos) + 1UL;
}


/**
  * @brief  Enable the ADC conversion in sequence mode.
  * @rmtoll CONF     SEQUENCE     LL_ADC_SequenceModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SequenceModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_SEQUENCE);
}


/**
  * @brief  Disable the ADC conversion in sequence mode.
  * @rmtoll CONF     SEQUENCE     LL_ADC_SequenceModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SequenceModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_SEQUENCE);
}


/**
  * @brief  Check if the ADC conversion in sequence mode is enabled.
  * @rmtoll CONF     SEQUENCE     LL_ADC_IsSequenceModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: Sequence mode is not enabled, 1: Sequence mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsSequenceModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_SEQUENCE) == (ADC_CONF_SEQUENCE)) ? 1UL : 0UL);
}


/**
  * @brief  Enable the ADC continuous conversion mode.
  *         When a sequence is over, the conversion starts again.
  * @note   Stop the conversion can be made by sets the STOP_OP_MODE bit.
  *         Call the API @ref LL_ADC_StopConversion().
  * @rmtoll CONF     CONT     LL_ADC_ContinuousModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ContinuousModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_CONT);
}


/**
  * @brief  Disable the ADC continuous conversion mode.
  *         When a sequence is over, the conversion stops (single conversion mode).
  * @rmtoll CONF     CONT     LL_ADC_ContinuousModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ContinuousModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_CONT);
}


/**
  * @brief  Check if the ADC continuous conversion mode is enabled.
  * @rmtoll CONF     CONT     LL_ADC_IsContinuousModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: Continuous mode is not enabled, 1: Continuous mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsContinuousModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_CONT) == (ADC_CONF_CONT)) ? 1UL : 0UL);
}

/**
  * @}
  */


/** @defgroup ADC_LL_EF_Control_ADC ADC Control functions
  * @{
  */

#if defined(ADC_CTRL_ADC_LDO_ENA)
/**
  * @brief  Enable the LDO associated to the ADC block.
  * @note   This bit must not be set on QFN32 package.
  * @rmtoll CTRL     ADC_LDO_ENA     LL_ADC_EnableInternalRegulator
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_EnableInternalRegulator(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_ADC_LDO_ENA);
}


/**
  * @brief  Disable the LDO associated to the ADC block.
  * @note   This bit must not be set on QFN32 package.
  * @rmtoll CTRL     ADC_LDO_ENA     LL_ADC_DisableInternalRegulator
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DisableInternalRegulator(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CTRL, ADC_CTRL_ADC_LDO_ENA);
}


/**
  * @brief  Check if the LDO associated to the ADC block is enabled.
  * @note   This bit must not be set on QFN32 package.
  * @rmtoll CTRL     ADC_LDO_ENA     LL_ADC_IsInternalRegulatorEnabled
  * @param  ADCx ADC instance
  * @retval 0: LDO is not enabled, 1: LDO is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsInternalRegulatorEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_ADC_LDO_ENA) == (ADC_CTRL_ADC_LDO_ENA)) ? 1UL : 0UL);
}
#endif /* ADC_CTRL_ADC_LDO_ENA */

