stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
#if defined(ADC_CTRL_DIG_AUD_MODE)
/**
  * @brief  Enable the digital audio mode.
  * @rmtoll CTRL     DIG_AUD_MODE     LL_ADC_AudioModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_AudioModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_DIG_AUD_MODE);
}


/**
  * @brief  Disable the digital audio mode.
  * @rmtoll CTRL     DIG_AUD_MODE     LL_ADC_AudioModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_AudioModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CTRL, ADC_CTRL_DIG_AUD_MODE);
}

/**
  * @brief  Check if the digital audio mode is enabled.
  * @rmtoll CTRL     DIG_AUD_MODE     LL_ADC_IsAudioModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: audio mode is not enabled, 1: audio mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsAudioModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_DIG_AUD_MODE) == (ADC_CTRL_DIG_AUD_MODE)) ? 1UL : 0UL);
}
#endif /* ADC_CTRL_DIG_AUD_MODE */

/**
  * @brief  Stop the ongoing ADC conversion.
  * @note   This bit is set by software and cleared by hardware.
  * @note   When the STOP_MODE_OP is set, the user has to wait around 10 us before
  *         to start a new ADC conversion (set START_CONV bit).
  * @rmtoll CTRL     STOP_OP_MODE     LL_ADC_StopConversion
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_StopConversion(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_STOP_OP_MODE);
}


/**
  * @brief  Check if the stop conversion is ongoing.
  * @rmtoll CTRL     STOP_OP_MODE     LL_ADC_IsStopConversionOngoing
  * @param  ADCx ADC instance
  * @retval 0: stop conversion is not ongoing, 1: stop conversion is ongoing.
  */
__STATIC_INLINE uint32_t LL_ADC_IsStopConversionOngoing(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_STOP_OP_MODE) == (ADC_CTRL_STOP_OP_MODE)) ? 1UL : 0UL);
}


/**
  * @brief  Start an ADC conversion.
  * @note   This bit is set by software and cleared by hardware.
  * @rmtoll CTRL     START_CONV     LL_ADC_StartConversion
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_StartConversion(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_START_CONV);
}


/**
  * @brief  Check if the ADC conversion is ongoing.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_IsConversionOngoing
  * @param  ADCx ADC instance
  * @retval 0: ADC conversion is not ongoing, 1: ADC conversion is ongoing.
  */
__STATIC_INLINE uint32_t LL_ADC_IsConversionOngoing(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF) == (ADC_CTRL_ADC_ON_OFF)) ? 1UL : 0UL);
}


/**
  * @brief  Power on the ADC.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_Enable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_Enable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF);
}


/**
  * @brief  Power off the ADC.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_Disable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_Disable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF);
}


/**
  * @brief  Check if the ADC is on.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_IsEnabled
  * @param  ADCx ADC instance
  * @retval 0: ADC is off, 1: ADC is on.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF) == (ADC_CTRL_ADC_ON_OFF)) ? 1UL : 0UL);
}


/**
  * @}
  */


/** @defgroup ADC_LL_EF_Occasional_Mode ADC Occasional Mode Control functions
  * @{
  */

#if defined(ADC_OCM_CTRL_OCM_ENA)
/**
  * @brief  Start an ADC occasional conversion during an analog audio conversion or
  *         during an ADC full mode.
  * @note   This bit is set by software and cleared by hardware.
  * @rmtoll OCM_CTRL     OCM_ENA     LL_ADC_StartOccasionalConversionMode
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_StartOccasionalConversionMode(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->OCM_CTRL, ADC_OCM_CTRL_OCM_ENA);
}


/**
  * @brief  Check if the ADC occasional conversion is ongoing.
  * @rmtoll OCM_CTRL     OCM_ENA     LL_ADC_IsOccasionalConversionModeOngoing
  * @param  ADCx ADC instance
  * @retval 0: ADC occasional conversion is not ongoing, 1: ADC occasional conversion is ongoing.
  */
__STATIC_INLINE uint32_t LL_ADC_IsOccasionalConversionModeOngoing(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->OCM_CTRL, ADC_OCM_CTRL_OCM_ENA) == (ADC_OCM_CTRL_OCM_ENA)) ? 1UL : 0UL);
}
#endif

#if defined(ADC_OCM_CTRL_OCM_SRC)
/**
  * @brief  Set the ADC occasional conversion source.
  *         ADC conversion from internal VBAT.
  *         ADC conversion from temperature sensor.
  * @rmtoll OCM_CTRL     OCM_SRC       LL_ADC_SetOccasionalConversionSource
  * @param  ADCx ADC instance
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OCM_SRC_VBAT
  *         @arg @ref LL_ADC_OCM_SRC_TEMP
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetOccasionalConversionSource(ADC_TypeDef *ADCx, uint32_t Source)
{
  MODIFY_REG(ADCx->OCM_CTRL, ADC_OCM_CTRL_OCM_SRC, Source);
}


/**
  * @brief  Get the ADC occasional conversion source.
  *         ADC conversion from internal VBAT.
  *         ADC conversion from temperature sensor.
  * @rmtoll OCM_CTRL     OCM_SRC       LL_ADC_GetOccasionalConversionSource
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_OCM_SRC_VBAT
  *         @arg @ref LL_ADC_OCM_SRC_TEMP
  */
__STATIC_INLINE uint32_t LL_ADC_GetOccasionalConversionSource(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->OCM_CTRL, ADC_OCM_CTRL_OCM_SRC));
}
#endif /* ADC_OCM_CTRL_OCM_SRC */

/**
  * @}
  */


/** @defgroup ADC_LL_EF_PGA_Configuration ADC PGA Configuration functions
  * @{
  */

#if defined(ADC_PGA_CONF_PGA_BIAS) && defined(ADC_PGA_CONF_PGA_GAIN)
/**
  * @brief  Configure the voltage bias and the gain for the PGA used in the ADC microphone mode.
  * @param  ADCx ADC instance
  * @param  Bias This parameter can be one of the following values:
  *         @arg @ref LL_ADC_PGA_BIAS_050_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_055_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_060_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_065_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_070_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_075_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_080_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_090_BAT
  * @param  Gain This parameter can be one of the following values:
  *         @arg @ref LL_ADC_PGA_GAIN_06_DB
  *         @arg @ref LL_ADC_PGA_GAIN_09_DB
  *         @arg @ref LL_ADC_PGA_GAIN_12_DB
  *         @arg @ref LL_ADC_PGA_GAIN_15_DB
  *         @arg @ref LL_ADC_PGA_GAIN_18_DB
  *         @arg @ref LL_ADC_PGA_GAIN_21_DB
  *         @arg @ref LL_ADC_PGA_GAIN_24_DB
  *         @arg @ref LL_ADC_PGA_GAIN_27_DB
  *         @arg @ref LL_ADC_PGA_GAIN_30_DB
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ConfigureMicrophonePGA(ADC_TypeDef *ADCx, uint32_t Bias, uint32_t Gain)
{
  MODIFY_REG(ADCx->PGA_CONF, (ADC_PGA_CONF_PGA_BIAS | ADC_PGA_CONF_PGA_GAIN), (Bias | Gain));
}


/**
  * @brief  Set the voltage bias for the PGA used in the ADC microphone mode.
  * @rmtoll PGA_CONF     PGA_BIAS       LL_ADC_SetMicrophonePGABias
  * @param  ADCx ADC instance
  * @param  Bias This parameter can be one of the following values:
  *         @arg @ref LL_ADC_PGA_BIAS_050_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_055_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_060_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_065_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_070_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_075_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_080_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_090_BAT
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetMicrophonePGABias(ADC_TypeDef *ADCx, uint32_t Bias)
{
  MODIFY_REG(ADCx->PGA_CONF, ADC_PGA_CONF_PGA_BIAS, Bias);
}


/**
  * @brief  Get the voltage bias for the PGA used in the ADC microphone mode.
  * @rmtoll PGA_CONF     PGA_BIAS       LL_ADC_GetMicrophonePGABias
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_PGA_BIAS_050_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_055_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_060_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_065_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_070_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_075_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_080_BAT
  *         @arg @ref LL_ADC_PGA_BIAS_090_BAT
  */
__STATIC_INLINE uint32_t LL_ADC_GetMicrophonePGABias(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->PGA_CONF, ADC_PGA_CONF_PGA_BIAS));
}

/**
  * @brief  Set the gain for the PGA used in the ADC microphone mode.
  * @note   PGA gain of 6 dB is equivalent to the 2.4 V ADC full scale.
  * @rmtoll PGA_CONF     PGA_GAIN       LL_ADC_SetMicrophonePGAGain
  * @param  ADCx ADC instance
  * @param  Gain This parameter can be one of the following values:
  *         @arg @ref LL_ADC_PGA_GAIN_06_DB
  *         @arg @ref LL_ADC_PGA_GAIN_09_DB
  *         @arg @ref LL_ADC_PGA_GAIN_12_DB
  *         @arg @ref LL_ADC_PGA_GAIN_15_DB
  *         @arg @ref LL_ADC_PGA_GAIN_18_DB
  *         @arg @ref LL_ADC_PGA_GAIN_21_DB
  *         @arg @ref LL_ADC_PGA_GAIN_24_DB
  *         @arg @ref LL_ADC_PGA_GAIN_27_DB
  *         @arg @ref LL_ADC_PGA_GAIN_30_DB
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetMicrophonePGAGain(ADC_TypeDef *ADCx, uint32_t Gain)
{
  MODIFY_REG(ADCx->PGA_CONF, ADC_PGA_CONF_PGA_GAIN, Gain);
}


/**
  * @brief  Get the gain for the PGA used in the ADC microphone mode.
  * @note   PGA gain of 6 dB is equivalent to the 2.4 V ADC full scale.
  * @rmtoll PGA_CONF     PGA_GAIN       LL_ADC_GetMicrophonePGAGain
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_PGA_GAIN_06_DB
  *         @arg @ref LL_ADC_PGA_GAIN_09_DB
  *         @arg @ref LL_ADC_PGA_GAIN_12_DB
  *         @arg @ref LL_ADC_PGA_GAIN_15_DB
  *         @arg @ref LL_ADC_PGA_GAIN_18_DB
  *         @arg @ref LL_ADC_PGA_GAIN_21_DB
  *         @arg @ref LL_ADC_PGA_GAIN_24_DB
  *         @arg @ref LL_ADC_PGA_GAIN_27_DB
  *         @arg @ref LL_ADC_PGA_GAIN_30_DB
  */
__STATIC_INLINE uint32_t LL_ADC_GetMicrophonePGAGain(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->PGA_CONF, ADC_PGA_CONF_PGA_GAIN));
}
#endif /* ADC_PGA_CONF_PGA_BIAS && ADC_PGA_CONF_PGA_GAIN */

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Input_Switch_Selection ADC Input Switch Selection functions
  * @{
  */

/**
  * @brief  Set the input voltage range for selected channel.
  * @rmtoll SWITCH     SE_VIN_0       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_1       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_2       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_3       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_4       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_5       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_6       LL_ADC_SetChannelVoltageRange\n
  *         SWITCH     SE_VIN_7       LL_ADC_SetChannelVoltageRange
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VINP0
  *         @arg @ref LL_ADC_CHANNEL_VINP1
  *         @arg @ref LL_ADC_CHANNEL_VINP2
  *         @arg @ref LL_ADC_CHANNEL_VINP3
  *         @arg @ref LL_ADC_CHANNEL_VINP0_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINP1_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINP2_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINP3_VINM3
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetChannelVoltageRange(ADC_TypeDef *ADCx, uint32_t Channel, uint32_t Range)
{
  MODIFY_REG(ADCx->SWITCH, (ADC_SWITCH_SE_VIN_0 << ADC_CHANNEL_SWITCH_POS_LUT[Channel]),
             (Range << ADC_CHANNEL_SWITCH_POS_LUT[Channel]));
}

/**
  * @brief  Get the input voltage range for selected channel.
  * @rmtoll SWITCH     SE_VIN_0       LL_ADC_GetChannelVoltageRange
  *         SWITCH     SE_VIN_1       LL_ADC_GetChannelVoltageRange\n
  *         SWITCH     SE_VIN_2       LL_ADC_GetChannelVoltageRange\n
  *         SWITCH     SE_VIN_3       LL_ADC_GetChannelVoltageRange\n
  *         SWITCH     SE_VIN_4       LL_ADC_GetChannelVoltageRange\n
  *         SWITCH     SE_VIN_5       LL_ADC_GetChannelVoltageRange\n
  *         SWITCH     SE_VIN_6       LL_ADC_GetChannelVoltageRange\n
  *         SWITCH     SE_VIN_7       LL_ADC_GetChannelVoltageRange
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VINP0
  *         @arg @ref LL_ADC_CHANNEL_VINP1
  *         @arg @ref LL_ADC_CHANNEL_VINP2
  *         @arg @ref LL_ADC_CHANNEL_VINP3
  *         @arg @ref LL_ADC_CHANNEL_VINP0_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINP1_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINP2_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINP3_VINM3
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  */
__STATIC_INLINE uint32_t LL_ADC_GetChannelVoltageRange(const ADC_TypeDef *ADCx, uint32_t Channel)
{
  return ((uint32_t)(READ_BIT(ADCx->SWITCH, ADC_SWITCH_SE_VIN_0 << ADC_CHANNEL_SWITCH_POS_LUT[Channel]))
          >> ADC_CHANNEL_SWITCH_POS_LUT[Channel]);
}

/**
  * @}
  */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/** @defgroup ADC_LL_EF_DF_Configuration ADC Decimation Filter Configuration functions
  * @{
  */

/**
  * @brief  Set the input dynamic range for Decimation Filter (DF).
  *         It can be full dynamic or half dynamic.
  * @rmtoll DF_CONF     DF_HALF_D_EN       LL_ADC_SetDFInputDynamic
  * @param  ADCx ADC instance
  * @param  Dynamic This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DF_DYN_RANGE_FULL
  *         @arg @ref LL_ADC_DF_DYN_RANGE_HALF
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetDFInputDynamic(ADC_TypeDef *ADCx, uint32_t Dynamic)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_DF_HALF_D_EN, Dynamic);
}


/**
  * @brief  Get the input dynamic ragne for Decimation Filter (DF).
  *         It can be full dynamic or half dynamic.
  * @rmtoll DF_CONF     DF_HALF_D_EN       LL_ADC_GetDFInputDynamic
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DF_DYN_RANGE_FULL
  *         @arg @ref LL_ADC_DF_DYN_RANGE_HALF
  */
__STATIC_INLINE uint32_t LL_ADC_GetDFInputDynamic(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_HALF_D_EN));
}

/**
  * @brief  Enable the High Pass Filter (HPF) of the Decimation Filter (DF).
  *         The HPF cut off frequency is 40 Hz.
  * @rmtoll DF_CONF     DF_HPF_EN     LL_ADC_DFHighPassFilterEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DFHighPassFilterEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_HPF_EN);
}


/**
  * @brief  Disable the High Pass Filter (HPF) of the Decimation Filter (DF).
  *         The HPF cut off frequency is 40 Hz.
  * @rmtoll DF_CONF     DF_HPF_EN     LL_ADC_DFHighPassFilterDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DFHighPassFilterDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_HPF_EN);
}

/**
  * @brief  Check if the High Pass Filter (HPF) of the Decimation Filter (DF) is enabled.
  * @rmtoll DF_CONF     DF_HPF_EN     LL_ADC_IsDFHighPassFilterEnabled
  * @param  ADCx ADC instance
  * @retval 0: HPF is not enabled, 1: HPF is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsDFHighPassFilterEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_HPF_EN) == (ADC_DF_CONF_DF_HPF_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Select the left/right channel on digital microphone mode.
  * @rmtoll DF_CONF     DF_MICROL_RN       LL_ADC_SetMicrophoneChannel
  * @param  ADCx ADC instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DF_MIC_CH_LEFT
  *         @arg @ref LL_ADC_DF_MIC_CH_RIGHT
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetMicrophoneChannel(ADC_TypeDef *ADCx, uint32_t Channel)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_DF_MICROL_RN, Channel);
}

/**
  * @brief  Get the left/right channel on digital microphone mode.
  * @rmtoll DF_CONF     DF_MICROL_RN       LL_ADC_GetMicrophoneChannel
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DF_MIC_CH_LEFT
  *         @arg @ref LL_ADC_DF_MIC_CH_RIGHT
  */
__STATIC_INLINE uint32_t LL_ADC_GetMicrophoneChannel(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_MICROL_RN));
}

/**
  * @brief  Set the PDM clock rate.
  *         The PDM clock rate is : SYSTEM_CLOCK / (Divider).
  * @note   With a SYSTEM_CLOCK of 32 MHz, the PDM clock rate is:
  *         3.2  MHz with Divider = 10.
  *         1.28 MHz with Divider = 25.
  * @rmtoll DF_CONF     PDM_RATE       LL_ADC_SetPDMRate
  * @param  ADCx ADC instance
  * @param  Divider This parameter can be one of the following values:
  *         @arg @ref LL_ADC_PDM_DIV_10
  *         @arg @ref LL_ADC_PDM_DIV_11
  *         @arg @ref LL_ADC_PDM_DIV_12
  *         @arg @ref LL_ADC_PDM_DIV_13
  *         @arg @ref LL_ADC_PDM_DIV_14
  *         @arg @ref LL_ADC_PDM_DIV_15
  *         @arg @ref LL_ADC_PDM_DIV_16
  *         @arg @ref LL_ADC_PDM_DIV_17
  *         @arg @ref LL_ADC_PDM_DIV_18
  *         @arg @ref LL_ADC_PDM_DIV_19
  *         @arg @ref LL_ADC_PDM_DIV_20
  *         @arg @ref LL_ADC_PDM_DIV_21
  *         @arg @ref LL_ADC_PDM_DIV_22
  *         @arg @ref LL_ADC_PDM_DIV_23
  *         @arg @ref LL_ADC_PDM_DIV_24
  *         @arg @ref LL_ADC_PDM_DIV_25
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetPDMRate(ADC_TypeDef *ADCx, uint32_t Divider)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_PDM_RATE, Divider);
}


/**
  * @brief  Get the PDM clock rate.
  *         The PDM clock rate is : SYSTEM_CLOCK / (Divider).
  * @note   With a SYSTEM_CLOCK of 32 MHz, the PDM clock rate is:
  *         3.2  MHz with Divider = 10.
  *         1.28 MHz with Divider = 25.
  * @rmtoll DF_CONF     PDM_RATE       LL_ADC_GetPDMRate
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_PDM_DIV_10
  *         @arg @ref LL_ADC_PDM_DIV_11
  *         @arg @ref LL_ADC_PDM_DIV_12
  *         @arg @ref LL_ADC_PDM_DIV_13
  *         @arg @ref LL_ADC_PDM_DIV_14
  *         @arg @ref LL_ADC_PDM_DIV_15
  *         @arg @ref LL_ADC_PDM_DIV_16
  *         @arg @ref LL_ADC_PDM_DIV_17
  *         @arg @ref LL_ADC_PDM_DIV_18
  *         @arg @ref LL_ADC_PDM_DIV_19
  *         @arg @ref LL_ADC_PDM_DIV_20
  *         @arg @ref LL_ADC_PDM_DIV_21
  *         @arg @ref LL_ADC_PDM_DIV_22
  *         @arg @ref LL_ADC_PDM_DIV_23
  *         @arg @ref LL_ADC_PDM_DIV_24
  *         @arg @ref LL_ADC_PDM_DIV_25
  */
__STATIC_INLINE uint32_t LL_ADC_GetPDMRate(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_PDM_RATE) + 10UL);
}

/**
  * @brief  Set the signed/unsigned output data format.
  * @rmtoll DF_CONF     DF_O_S2U       LL_ADC_SetDataOutputFormat
  * @param  ADCx ADC instance
  * @param  Format This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_SIGNED
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_UNSIGNED
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetDataOutputFormat(ADC_TypeDef *ADCx, uint32_t Format)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_DF_O_S2U, (Format << ADC_DF_CONF_DF_O_S2U_Pos));
}


/**
  * @brief  Get the signed/unsigned output data format.
  * @rmtoll DF_CONF     DF_O_S2U       LL_ADC_GetDataOutputFormat
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_SIGNED
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_UNSIGNED
  */
__STATIC_INLINE uint32_t LL_ADC_GetDataOutputFormat(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)(READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_O_S2U)) >> ADC_DF_CONF_DF_O_S2U_Pos);
}

/**
  * @brief  Set the signed/unsigned input data format.
  * @rmtoll DF_CONF     DF_I_S2U       LL_ADC_SetDataInputFormat
  * @param  ADCx ADC instance
  * @param  Format This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_SIGNED
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_UNSIGNED
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetDataInputFormat(ADC_TypeDef *ADCx, uint32_t Format)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_DF_I_U2S, ~((Format) << ADC_DF_CONF_DF_I_U2S_Pos) & ADC_DF_CONF_DF_I_U2S);
}


/**
  * @brief  Get the signed/unsigned input data format.
  * @rmtoll DF_CONF     DF_I_S2U       LL_ADC_GetDataInputFormat
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_SIGNED
  *         @arg @ref LL_ADC_DF_DATA_FORMAT_UNSIGNED
  */
__STATIC_INLINE uint32_t LL_ADC_GetDataInputFormat(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)((READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_I_U2S)) == ADC_DF_CONF_DF_I_U2S) ?
          LL_ADC_DF_DATA_FORMAT_SIGNED : LL_ADC_DF_DATA_FORMAT_UNSIGNED);
}

/**
  * @brief  Enable the fractional interpolator.
  * @note   This bit must be set only for the generation of a data rate
  *         at 200 kps from ADC data at 1 MHz.
  * @rmtoll DF_CONF     DF_ITP1P2     LL_ADC_FractionalInterpolatorEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_FractionalInterpolatorEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_ITP1P2);
}


/**
  * @brief  Disable the fractional interpolator.
  * @note   This bit must be set only for the generation of a data rate
  *         at 200 kps from ADC data at 1 MHz.
  * @rmtoll DF_CONF     DF_ITP1P2     LL_ADC_FractionalInterpolatorDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_FractionalInterpolatorDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_ITP1P2);
}

/**
  * @brief  Check if the fractional interpolator is enabled.
  * @rmtoll DF_CONF     DF_ITP1P2     LL_ADC_IsFractionalInterpolatorEnabled
  * @param  ADCx ADC instance
  * @retval 0: Interpolator is not enabled, 1: Interpolator is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsFractionalInterpolatorEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_ITP1P2) == (ADC_DF_CONF_DF_ITP1P2)) ? 1UL : 0UL);
}

