stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
/**
  * @brief  Set the decimator factor of the CIC filter.
  * @note   This bit must be set (LL_ADC_DF_CIC_DECIMATOR_FACTOR_HALF)
  *         only for the generation of a data rate
  *         at 44.1 kps from ADC data at 1 MHz.
  * @rmtoll DF_CONF     DF_CIC_DHF       LL_ADC_SetCICDecimatorFactor
  * @param  ADCx ADC instance
  * @param  Factor This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DF_CIC_DECIMATOR_FACTOR_HALF
  *         @arg @ref LL_ADC_DF_CIC_DECIMATOR_FACTOR_INTEGER
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetCICDecimatorFactor(ADC_TypeDef *ADCx, uint32_t Factor)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_DF_CIC_DHF, Factor);
}


/**
  * @brief  Get the decimator factor of the CIC filter.
  * @rmtoll DF_CONF     DF_CIC_DHF       LL_ADC_GetCICDecimatorFactor
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DF_CIC_DECIMATOR_FACTOR_HALF
  *         @arg @ref LL_ADC_DF_CIC_DECIMATOR_FACTOR_INTEGER
  */
__STATIC_INLINE uint32_t LL_ADC_GetCICDecimatorFactor(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)(READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_CIC_DHF)));
}

/**
  * @brief  Set the output frequency for the microphone mode.
  * @rmtoll DF_CONF     DF_CIC_DEC_FACTOR       LL_ADC_SetMicrophoneOutputDatarate
  * @note   Different parameters for digital microphone and analog microphone.
  * @param  ADCx ADC instance
  * @param  Frequency This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_47619_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_44440_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_22220_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_15873_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_7936_HZ
  *
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_ANA_200000_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_ANA_15873_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_ANA_7936_HZ
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetMicrophoneOutputDatarate(ADC_TypeDef *ADCx, uint32_t Frequency)
{
  MODIFY_REG(ADCx->DF_CONF, ADC_DF_CONF_DF_CIC_DEC_FACTOR, Frequency);
}


/**
  * @brief  Get the output frequency for the microphone mode.
  * @rmtoll DF_CONF     DF_CIC_DEC_FACTOR       LL_ADC_GetMicrophoneOutputDatarate
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_47619_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_44440_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_22220_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_15873_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_DIG_7936_HZ
  *
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_ANA_200000_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_ANA_15873_HZ
  *         @arg @ref LL_ADC_OUTPUT_FREQ_MIC_ANA_7936_HZ
  */
__STATIC_INLINE uint32_t LL_ADC_GetMicrophoneOutputDatarate(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DF_CONF, ADC_DF_CONF_DF_CIC_DEC_FACTOR));
}
/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/** @defgroup ADC_LL_EF_DS_Configuration ADC Down Sampler Configuration functions
  * @{
  */

/**
  * @brief  Configure the width (in bit) and the ratio of the output data from the Down Sampler.
  * @param  ADCx ADC instance
  * @param  Width This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT (default)
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @param  Ratio This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_RATIO_1 (no down sampling, default)
  *         @arg @ref LL_ADC_DS_RATIO_2
  *         @arg @ref LL_ADC_DS_RATIO_4
  *         @arg @ref LL_ADC_DS_RATIO_8
  *         @arg @ref LL_ADC_DS_RATIO_16
  *         @arg @ref LL_ADC_DS_RATIO_32
  *         @arg @ref LL_ADC_DS_RATIO_64
  *         @arg @ref LL_ADC_DS_RATIO_128
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ConfigureDSDataOutput(ADC_TypeDef *ADCx, uint32_t Width, uint32_t Ratio)
{
  MODIFY_REG(ADCx->DS_CONF, (ADC_DS_CONF_DS_WIDTH | ADC_DS_CONF_DS_RATIO),
             ((Width << ADC_DS_CONF_DS_WIDTH_Pos) | Ratio));
}

/**
  * @brief  Set the width (in bit) of the output data from the Down Sampler.
  * @rmtoll DS_CONF     DS_WIDTH       LL_ADC_SetDSDataOutputWidth
  * @param  ADCx ADC instance
  * @param  Width This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT (default)
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetDSDataOutputWidth(ADC_TypeDef *ADCx, uint32_t Width)
{
  MODIFY_REG(ADCx->DS_CONF, ADC_DS_CONF_DS_WIDTH, (Width << ADC_DS_CONF_DS_WIDTH_Pos));
}


/**
  * @brief  Get the width (in bit) of the output data from the Down Sampler (DS).
  * @rmtoll DS_CONF     DS_WIDTH       LL_ADC_GetDSDataOutputWidth
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT (default)
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  */
__STATIC_INLINE uint32_t LL_ADC_GetDSDataOutputWidth(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DS_CONF, ADC_DS_CONF_DS_WIDTH) >> ADC_DS_CONF_DS_WIDTH_Pos);
}


/**
  * @brief  Set the ratio of the Down Sampler (DS).
  * @rmtoll DS_CONF     DS_RATIO       LL_ADC_SetDSDataOutputRatio
  * @param  ADCx ADC instance
  * @param  Ratio This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_RATIO_1 (no down sampling, default)
  *         @arg @ref LL_ADC_DS_RATIO_2
  *         @arg @ref LL_ADC_DS_RATIO_4
  *         @arg @ref LL_ADC_DS_RATIO_8
  *         @arg @ref LL_ADC_DS_RATIO_16
  *         @arg @ref LL_ADC_DS_RATIO_32
  *         @arg @ref LL_ADC_DS_RATIO_64
  *         @arg @ref LL_ADC_DS_RATIO_128
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetDSDataOutputRatio(ADC_TypeDef *ADCx, uint32_t Ratio)
{
  MODIFY_REG(ADCx->DS_CONF, ADC_DS_CONF_DS_RATIO, Ratio);
}


/**
  * @brief  Get the ratio of the Down Sampler (DS).
  * @rmtoll DS_CONF     DS_RATIO       LL_ADC_GetDSDataOutputRatio
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_DS_RATIO_1 (no down sampling, default)
  *         @arg @ref LL_ADC_DS_RATIO_2
  *         @arg @ref LL_ADC_DS_RATIO_4
  *         @arg @ref LL_ADC_DS_RATIO_8
  *         @arg @ref LL_ADC_DS_RATIO_16
  *         @arg @ref LL_ADC_DS_RATIO_32
  *         @arg @ref LL_ADC_DS_RATIO_64
  *         @arg @ref LL_ADC_DS_RATIO_128
  */
__STATIC_INLINE uint32_t LL_ADC_GetDSDataOutputRatio(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DS_CONF, ADC_DS_CONF_DS_RATIO));
}

/**
  * @}
  */


/** @defgroup ADC_LL_EF_Sequence_Configuration ADC Sequence Configuration functions
  * @{
  */

/**
  * @brief  Set ADC sequence: channel on the selected
  *         scan sequence rank.
  * @note   This function performs configuration of:
  *         - Channels ordering into each rank of scan sequence:
  *           whatever channel can be placed into whatever rank.
  * @note   On this STM32 series, ADCsequencer is
  *         fully configurable: sequencer length and each rank
  *         affectation to a channel are configurable.
  *         Refer to description of function @ref LL_ADC_SetSequencerLength().
  * @note   Depending on devices and packages, some channels may not be available.
  *         Refer to device datasheet for channels availability.
  * @rmtoll SEQ_1     SEQ1            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ1            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ2            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ3            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ4            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ5            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ6            LL_ADC_SetSequencerRanks\n
  *         SEQ_1     SEQ7            LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ8            LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ9            LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ10           LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ11           LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ12           LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ13           LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ14           LL_ADC_SetSequencerRanks\n
  *         SEQ_2     SEQ15           LL_ADC_SetSequencerRanks
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RANK_1
  *         @arg @ref LL_ADC_RANK_2
  *         @arg @ref LL_ADC_RANK_3
  *         @arg @ref LL_ADC_RANK_4
  *         @arg @ref LL_ADC_RANK_5
  *         @arg @ref LL_ADC_RANK_6
  *         @arg @ref LL_ADC_RANK_7
  *         @arg @ref LL_ADC_RANK_8
  *         @arg @ref LL_ADC_RANK_9
  *         @arg @ref LL_ADC_RANK_10
  *         @arg @ref LL_ADC_RANK_11
  *         @arg @ref LL_ADC_RANK_12
  *         @arg @ref LL_ADC_RANK_13
  *         @arg @ref LL_ADC_RANK_14
  *         @arg @ref LL_ADC_RANK_15
  *         @arg @ref LL_ADC_RANK_16
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VINP0
  *         @arg @ref LL_ADC_CHANNEL_VINP1
  *         @arg @ref LL_ADC_CHANNEL_VINP2
  *         @arg @ref LL_ADC_CHANNEL_VINP3
  *         @arg @ref LL_ADC_CHANNEL_VINP0_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINP1_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINP2_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINP3_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VBAT
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetSequencerRanks(ADC_TypeDef *ADCx, uint32_t Rank, uint32_t Channel)
{
  /* Set bits with content of parameter "Channel" with bits position          */
  /* in register and register position depending on parameter "Rank".         */
  /* Parameters "Rank" and "Channel" are used with masks because containing   */
  /* other bits reserved for other purpose.                                   */
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->SEQ_1,
                                             ((Rank & ADC_SEQ_X_REGOFFSET_MASK) >> ADC_SEQ_X_REGOFFSET_POS));

  MODIFY_REG(*preg,
             ADC_SEQ_1_SEQ0 << (Rank & ADC_RANK_ID_SEQ_X_MASK),
             (Channel) << (Rank & ADC_RANK_ID_SEQ_X_MASK));
}


/**
  * @brief  Get ADC sequence: channel on the selected
  *         scan sequence rank.
  * @note   On this STM32 series, ADC sequencer is
  *         fully configurable: sequencer length and each rank
  *         affectation to a channel are configurable.
  *         Refer to description of function @ref LL_ADC_SetSequencerLength().
  * @note   Depending on devices and packages, some channels may not be available.
  *         Refer to device datasheet for channels availability.
  * @rmtoll SEQ_1     SEQ0            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ1            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ2            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ3            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ4            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ5            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ6            LL_ADC_GetSequencerRanks\n
  *         SEQ_1     SEQ7            LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ8            LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ9            LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ10           LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ11           LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ12           LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ13           LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ14           LL_ADC_GetSequencerRanks\n
  *         SEQ_2     SEQ15           LL_ADC_GetSequencerRanks
  * @param  ADCx ADC instance
  * @param  Rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RANK_1
  *         @arg @ref LL_ADC_RANK_2
  *         @arg @ref LL_ADC_RANK_3
  *         @arg @ref LL_ADC_RANK_4
  *         @arg @ref LL_ADC_RANK_5
  *         @arg @ref LL_ADC_RANK_6
  *         @arg @ref LL_ADC_RANK_7
  *         @arg @ref LL_ADC_RANK_8
  *         @arg @ref LL_ADC_RANK_9
  *         @arg @ref LL_ADC_RANK_10
  *         @arg @ref LL_ADC_RANK_11
  *         @arg @ref LL_ADC_RANK_12
  *         @arg @ref LL_ADC_RANK_13
  *         @arg @ref LL_ADC_RANK_14
  *         @arg @ref LL_ADC_RANK_15
  *         @arg @ref LL_ADC_RANK_16
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VINP0
  *         @arg @ref LL_ADC_CHANNEL_VINP1
  *         @arg @ref LL_ADC_CHANNEL_VINP2
  *         @arg @ref LL_ADC_CHANNEL_VINP3
  *         @arg @ref LL_ADC_CHANNEL_VINP0_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINP1_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINP2_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINP3_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VBAT
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR
  */
__STATIC_INLINE uint32_t LL_ADC_GetSequencerRanks(const ADC_TypeDef *ADCx, uint32_t Rank)
{
  const __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->SEQ_1,
                                                   ((Rank & ADC_SEQ_X_REGOFFSET_MASK) >> ADC_SEQ_X_REGOFFSET_POS));

  return (uint32_t)((READ_BIT(*preg,
                              ADC_SEQ_1_SEQ0 << (Rank & ADC_RANK_ID_SEQ_X_MASK))
                     >> (Rank & ADC_RANK_ID_SEQ_X_MASK))
                   );
}

/**
  * @}
  */


/** @defgroup ADC_LL_EF_Calibration_Points_Configuration ADC Calibration Points Configuration functions
  * @{
  */

/**
  * @brief  Configure the gain and the offset of the calibration point 1.
  * @param  ADCx ADC instance
  * @param  Gain the gain of the first calibration point.
  * @param  Offset the signed offset of the first calibration point.
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ConfigureCalibPoint(ADC_TypeDef *ADCx, uint32_t Point, uint32_t Gain, uint32_t Offset)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->COMP_1, Point);

  MODIFY_REG(*preg, (ADC_COMP_1_GAIN1 | ADC_COMP_1_OFFSET1),
             ((Gain & ADC_COMP_1_GAIN1) | ((Offset << ADC_COMP_1_OFFSET1_Pos) & ADC_COMP_1_OFFSET1)));
}

/**
  * @brief  Set the gain of the calibration point 1.
  * @rmtoll COMP_1     GAIN1       LL_ADC_SetCalibPointGain
  * @param  ADCx ADC instance
  * @param  Gain the gain of the first calibration point.
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetCalibPointGain(ADC_TypeDef *ADCx, uint32_t Point, uint32_t Gain)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->COMP_1, Point);

  MODIFY_REG(*preg, ADC_COMP_1_GAIN1, Gain);
}


/**
  * @brief  Get the gain of the calibration point 1.
  * @rmtoll COMP_1     GAIN1       LL_ADC_GetCalibPointGain
  * @param  ADCx ADC instance
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @retval Return the gain of the first calibration point.
  */
__STATIC_INLINE uint32_t LL_ADC_GetCalibPointGain(const ADC_TypeDef *ADCx, uint32_t Point)
{
  const __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->COMP_1, Point);

