stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
/** @defgroup ADC_LL_EF_AWD_TH_Configuration ADC Watchdog Thresholds Configuration functions
  * @{
  */

/**
  * @brief  Configure the WatchDoG threshold low and high.
  * @rmtoll WD_TH     ADC_WD_TH_WD_LT       LL_ADC_ConfigureAWDThresholds\n
  *         WD_TH     ADC_WD_TH_WD_HT       LL_ADC_ConfigureAWDThresholds
  * @param  ADCx ADC instance
  * @param  LowThreshold This parameter is a 12-bit value.
  * @param  HighThreshold This parameter is a 12-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ConfigureAWDThresholds(ADC_TypeDef *ADCx, uint32_t LowThreshold, uint32_t HighThreshold)
{
  MODIFY_REG(ADCx->WD_TH, (ADC_WD_TH_WD_LT | ADC_WD_TH_WD_HT), (LowThreshold | (HighThreshold << ADC_WD_TH_WD_HT_Pos)));
}


/**
  * @brief  Set the WatchDoG threshold low.
  * @rmtoll WD_TH     ADC_WD_TH_WD_LT     LL_ADC_SetAWDThresholdLow
  * @param  ADCx ADC instance
  * @param  Threshold This parameter is a 12-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAWDThresholdLow(ADC_TypeDef *ADCx, uint32_t Threshold)
{
  MODIFY_REG(ADCx->WD_TH, ADC_WD_TH_WD_LT, Threshold);
}


/**
  * @brief  Get the WatchDoG threshold low.
  * @rmtoll WD_TH     ADC_WD_TH_WD_LT     LL_ADC_GetAWDThresholdLow
  * @param  ADCx ADC instance
  * @retval Returned value of the low threshold.
  */
__STATIC_INLINE uint32_t LL_ADC_GetAWDThresholdLow(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)(READ_BIT(ADCx->WD_TH, ADC_WD_TH_WD_LT)));
}

/**
  * @brief  Set the WatchDoG threshold high.
  * @rmtoll WD_TH     ADC_WD_TH_WD_HT     LL_ADC_SetAWDThresholdHigh
  * @param  ADCx ADC instance
  * @param  Threshold This parameter is a 12-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAWDThresholdHigh(ADC_TypeDef *ADCx, uint32_t Threshold)
{
  MODIFY_REG(ADCx->WD_TH, ADC_WD_TH_WD_HT, (Threshold << ADC_WD_TH_WD_HT_Pos));
}


/**
  * @brief  Get the WatchDoG threshold high.
  * @rmtoll WD_TH     ADC_WD_TH_WD_HT     LL_ADC_GetAWDThresholdHigh
  * @param  ADCx ADC instance
  * @retval Returned value of the high threshold.
  */
__STATIC_INLINE uint32_t LL_ADC_GetAWDThresholdHigh(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)(READ_BIT(ADCx->WD_TH, ADC_WD_TH_WD_HT) >> ADC_WD_TH_WD_HT_Pos));
}


/**
  * @brief  Set the input channels the watchdog must check.
  * @note   ChannelMask can be an OR of the listed parameters.
  * @rmtoll WD_CONF     AWD_CHX       LL_ADC_SetAWDInputChannels
  * @param  ADCx ADC instance
  * @param  ChannelMask This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_AWD_CH_VINM0
  *         @arg @ref LL_ADC_AWD_CH_VINM1
  *         @arg @ref LL_ADC_AWD_CH_VINM2
  *         @arg @ref LL_ADC_AWD_CH_VINM3
  *         @arg @ref LL_ADC_AWD_CH_MICROM
  *         @arg @ref LL_ADC_AWD_CH_VBAT
  *         @arg @ref LL_ADC_AWD_CH_GND_NEG
  *         @arg @ref LL_ADC_AWD_CH_VDDA_NEG
  *         @arg @ref LL_ADC_AWD_CH_VINP0
  *         @arg @ref LL_ADC_AWD_CH_VINP1
  *         @arg @ref LL_ADC_AWD_CH_VINP2
  *         @arg @ref LL_ADC_AWD_CH_VINP3
  *         @arg @ref LL_ADC_AWD_CH_MICROP
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR
  *         @arg @ref LL_ADC_AWD_CH_GND_POS
  *         @arg @ref LL_ADC_AWD_CH_VDDA_POS
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAWDInputChannels(ADC_TypeDef *ADCx, uint32_t ChannelMask)
{
  MODIFY_REG(ADCx->WD_CONF, ADC_WD_CONF_AWD_CHX, ChannelMask);
}


/**
  * @brief  Get the input channels the watchdog must check.
  * @note   The returned value can be an OR of the listed parameters.
  * @rmtoll WD_CONF     AWD_CHX       LL_ADC_GetAWDInputChannels
  * @param  ADCx ADC instance
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_ADC_AWD_CH_VINM0
  *         @arg @ref LL_ADC_AWD_CH_VINM1
  *         @arg @ref LL_ADC_AWD_CH_VINM2
  *         @arg @ref LL_ADC_AWD_CH_VINM3
  *         @arg @ref LL_ADC_AWD_CH_MICROM
  *         @arg @ref LL_ADC_AWD_CH_VBAT
  *         @arg @ref LL_ADC_AWD_CH_GND_NEG
  *         @arg @ref LL_ADC_AWD_CH_VDDA_NEG
  *         @arg @ref LL_ADC_AWD_CH_VINP0
  *         @arg @ref LL_ADC_AWD_CH_VINP1
  *         @arg @ref LL_ADC_AWD_CH_VINP2
  *         @arg @ref LL_ADC_AWD_CH_VINP3
  *         @arg @ref LL_ADC_AWD_CH_MICROP
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR
  *         @arg @ref LL_ADC_AWD_CH_GND_POS
  *         @arg @ref LL_ADC_AWD_CH_VDDA_POS
  */
__STATIC_INLINE uint32_t LL_ADC_GetAWDInputChannels(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->WD_CONF, ADC_WD_CONF_AWD_CHX));
}


/**
  * @}
  */


/** @defgroup ADC_LL_EF_Output_Data ADC Output Data functions
  * @{
  */


/**
  * @brief  Get the 16-bit output data from the Down Sampler (DS).
  * @rmtoll DS_DATAOUT       DS_DATA          LL_ADC_DSGetOutputData
  * @param  ADCx ADC instance
  * @retval The output data from DS.
  */
__STATIC_INLINE uint32_t LL_ADC_DSGetOutputData(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DS_DATAOUT, ADC_DS_DATAOUT_DS_DATA));
}

#if defined(ADC_DF_DATAOUT_DF_DATA)
/**
  * @brief  Get the 16-bit output data from the Decimation Filter (DF).
  * @rmtoll DF_DATAOUT       DF_DATA          LL_ADC_DFGetOutputData
  * @param  ADCx ADC instance
  * @retval The output data from DF.
  */
__STATIC_INLINE uint32_t LL_ADC_DFGetOutputData(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DF_DATAOUT, ADC_DF_DATAOUT_DF_DATA));
}
#endif /* DF_DATAOUT */

/**
  * @}
  */


/** @defgroup ADC_LL_EF_FLAG_Management ADC flag management
  * @{
  */

/**
  * @brief  Get all the flags status.
  * @param  ADCx ADC instance
  * @retval All the status flags of the register IRQ_STATUS.
  *         The value is a combination of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRFL
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDF
  *         @arg @ref LL_ADC_IRQ_FLAG_EODF
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  */
__STATIC_INLINE uint32_t LL_ADC_GetActiveFlags(ADC_TypeDef *ADCx)
{
#if defined(LL_ADC_IRQ_FLAGS_MASK)
  return (uint32_t)(READ_BIT(ADCx->IRQ_STATUS, LL_ADC_IRQ_FLAGS_MASK));
#else
  return 0;
#endif /* LL_ADC_IRQ_FLAGS_MASK */
}

/**
  * @brief  Clear all the flags status.
  * @param  ADCx ADC instance
  * @param  FlagsMask This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRFL
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDF
  *         @arg @ref LL_ADC_IRQ_FLAG_EODF
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  * @retval None.
  */
__STATIC_INLINE void LL_ADC_ClearActiveFlags(ADC_TypeDef *ADCx, uint32_t FlagsMask)
{
  WRITE_REG(ADCx->IRQ_STATUS, FlagsMask);
}

/**
  * @brief  Get if the flags status is set.
  * @param  ADCx ADC instance
  * @param  FlagsMask This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRFL
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDF
  *         @arg @ref LL_ADC_IRQ_FLAG_EODF
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag(const ADC_TypeDef *ADCx, uint32_t FlagsMask)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, FlagsMask) == (FlagsMask)) ? 1UL : 0UL);
}

#if defined(ADC_IRQ_STATUS_DF_OVRFL_IRQ)
/**
  * @brief  Get the status of the flag DF_OVRFL.
  *         The flag indicates, if set, the Decimation Filter output is saturated.
  * @rmtoll IRQ_STATUS      DF_OVRFL_IRQ     LL_ADC_IsActiveFlag_DFOVRFL
  * @param  ADCx ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_DFOVRFL(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_DF_OVRFL_IRQ) == (ADC_IRQ_STATUS_DF_OVRFL_IRQ)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flag DF_OVRFL.
  * @rmtoll IRQ_STATUS      DF_OVRFL_IRQ     LL_ADC_ClearFlag_DFOVRFL
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_DFOVRFL(ADC_TypeDef *ADCx)
{
  WRITE_REG(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_DF_OVRFL_IRQ);
}
#endif /* ADC_IRQ_STATUS_DF_OVRFL_IRQ */

