stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_adc.h
  return (int8_t)calibration_offset;
}


/**
  * @brief  Return the calibration value for the gain of
  *         single ended positive input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINPX_1V2(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_1V2) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended positive input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_1V2(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_1V2) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return (int8_t)calibration_offset;
}


/**
  * @brief  Return the calibration value for the gain of
  *         single ended negative input at range 3.6 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINMX_3V6(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINMX_3V6) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended negative input at range 3.6 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINMX_3V6(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINMX_3V6) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return - (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return - (int8_t)calibration_offset;
}

/**
  * @brief  Return the calibration value for the gain of
  *         single ended negative input at range 2.4 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINMX_2V4(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINMX_2V4) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended negative input at range 2.4 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINMX_2V4(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINMX_2V4) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return - (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return - (int8_t)calibration_offset;
}


/**
  * @brief  Return the calibration value for the gain of
  *         single ended negative input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINMX_1V2(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINMX_1V2) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended negative input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINMX_1V2(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINMX_1V2) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return - (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return - (int8_t)calibration_offset;
}


/**
  * @brief  Return the calibration value for the gain of
  *         differential input at range 3.6 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINDIFF_3V6(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINDIFF_3V6) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         differential input at range 3.6 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINDIFF_3V6(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINDIFF_3V6) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return ((int8_t)calibration_offset);
}

/**
  * @brief  Return the calibration value for the gain of
  *         differential input at range 2.4 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINDIFF_2V4(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINDIFF_2V4) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         differential input at range 2.4 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINDIFF_2V4(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINDIFF_2V4) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return ((int8_t)calibration_offset);
}


/**
  * @brief  Return the calibration value for the gain of
  *         differential input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINDIFF_1V2(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINDIFF_1V2) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         differential input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINDIFF_1V2(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINDIFF_1V2) >> 12UL);

#if defined(STM32WB07) || defined(STM32WB06)
  if (*(uint32_t *)ADC_LAYOUT_ID == 0UL)  /* Memory version 1 */
  {
    /* Negative number on 7-bit */
    if ((calibration_offset & 0x40U) == 0x40U)
    {
      return (int8_t)(calibration_offset | 0x80U);
    }
  }
#endif /* defined(STM32WB07) || defined(STM32WB06) */

  return ((int8_t)calibration_offset);
}

/**
  * @}
  */


#if defined(USE_FULL_LL_DRIVER)
/** @defgroup ADC_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

/* De-initialization of ADC instance */
ErrorStatus LL_ADC_DeInit(ADC_TypeDef *ADCx);

/* Initialization of ADC instance */
ErrorStatus LL_ADC_Init(ADC_TypeDef *ADCx, const LL_ADC_InitTypeDef *pADC_InitStruct);

/* Initialization of some features of ADC instance */
ErrorStatus LL_ADC_VoltageRangeInit(ADC_TypeDef *ADCx, const LL_ADC_VoltRangeInitTypeDef *pVoltRange_InitStruct);
ErrorStatus LL_ADC_SequenceInit(ADC_TypeDef *ADCx, const LL_ADC_SequenceInitTypeDef *pSequence_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ADC1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32WB0x_LL_ADC_H */
